---
kind: type
id: T:Autodesk.Revit.DB.Structure.IExtElemChangeBeamSection
source: html/671ee32a-30f6-57d4-1112-dd3ae1a8fbbe.htm
---
# Autodesk.Revit.DB.Structure.IExtElemChangeBeamSection

Interface Change Beam section functionality to be implemented in add-ins

## Syntax (C#)
```csharp
public interface IExtElemChangeBeamSection
```